lib_app/app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    user_params = params.require(:user).permit(:first_name, :last_name, :email, :password)
    @users = User.create(user_params)